# Exploring the Azrieli & Sons Data

## Libraries and data loading

In [1]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Looking for problems in the data

In [51]:
def calc_nan_df(df):
    nan_summary = df.isna().sum()
    nan_summary = nan_summary[nan_summary > 0].sort_values(ascending=False)
    nan_summary = nan_summary.reset_index()
    nan_summary.columns = ['Column', 'NaN Count']
    nan_summary['NaN Ratio'] = np.round(nan_summary['NaN Count'] / df.shape[0],2)
    return nan_summary

data_path = r'C:\Users\user\Desktop\CV Training Guy\CV_training\basic\python\Basic - Azrieli & Sons data'
old_drivers_df = pd.read_csv(os.path.join(data_path, 'Drivers_with_kviut.csv'))
new_drivers_df = pd.read_csv(os.path.join(data_path, 'new_drivers.csv'))
taarif_df = pd.read_csv(os.path.join(data_path, 'taarif.csv'))
trips_data_list = os.listdir(os.path.join(data_path, 'trips_data'))

### Drivers, old and new

In [3]:
new_drivers_df

    Unnamed: 0          birthdate gender   id  vetek
0            0         19.06.1967      F  943  232.0
1            1  february 13, 1979      M  966   28.0
2            2         19/11/1993      M  250   48.0
3            3         02/02/1961    NaN  156  272.0
4            4         07/03/1965      M   67  130.0
..         ...                ...    ...  ...    ...
95          95         16/08/1990      M  798  144.0
96          96         05/06/1967      M  865  103.0
97          97         02/10/1972      M  399  312.0
98          98         16/03/1979      M  509  172.0
99          99         27/10/1977      M  308  324.0

[100 rows x 5 columns]

First column (id) is redundant.

Second column (date) has different formats, which should be unified.

Third column (male) as above, some missing values as well. Should we keep unknown as a category or remove it? ASK

Rest seems ok.

In [52]:
calc_nan_df(new_drivers_df)

   Column  NaN Count  NaN Ratio
0  gender          3       0.03

In [57]:
old_drivers_df['gender'].value_counts()

gender
M          674
male        63
boy         37
unknown     37
m           36
F           17
female      10
girl         6
none         4
woman        3
Name: count, dtype: int64

Note that the vetek in the new drivers column is measured probably in days while in the old drivers column it is measured in years, should be unified.

Similar problems with the columns mentioned above.

In [53]:
calc_nan_df(old_drivers_df)

      Column  NaN Count  NaN Ratio
0     gender         13       0.01
1  birthdate         10       0.01

In [22]:
old_ids = old_drivers_df['id'].unique()
new_ids = new_drivers_df['id'].unique()
# intersect
common_ids = np.intersect1d(old_ids, new_ids)
common_ids

array([], dtype=int64)

### Salary

In [5]:
taarif_df

,customer,basic_taarif,extra_milage,night_bonus,weekend_bonus
0,NaN,NaN,NaN,NaN,NaN
1,jerusalem_muni,8.0,40.0,50.0,30.0
2,intel,8.0,6.0,20.0,0.0
3,mizranei_kfar_saba,15.0,4.0,0.0,25.0
4,dbs,10.0,8.0,0.0,25.0
5,tnuva,6.0,3.0,80.0,0.0
6,angel,1.0,5.0,100.0,0.0
7,telecommunication_ltd,7.0,7.0,10.0,40.0
8,osem,12.0,4.0,20.0,0.0
9,iaf,20.0,10.0,200.0,500.0
10,tara,6.0,6.0,50.0,30.0
11,electricity,10.0,NaN,40.0,70000.0
12,bituch_leumi,NaN,NaN,NaN,NaN

First row is just NaNs.

**Electricity** - missing data in extra milage (really missing or meant 0.0?), abnormal weekend bonus. ASK

**Bituch Leumi** - all data is missing. ASK

### Trips

Now for the trips data, noticed there are some duplicate files, meaning files with the same name (the duplicate usually denoted with and appended '(2)' after the file name).

In [6]:
trips_data_duplicates_list = [trip.split('.')[0] for trip in trips_data_list if '(' in trip]
whats_inside_parentheses = np.unique([trip.split('(')[1].split(')')[0] for trip in trips_data_duplicates_list])

In [7]:
trips_data_duplicates_list

['april 2015_4781355(2)',
 'april 2015_4781424(2)',
 'april 2015_4781442(2)',
 'april 2015_4781451(2)',
 'april 2015_4781460(2)',
 'april 2015_4781495(2)',
 'april 2015_4781695(2)',
 'april 2015_4781849(2)',
 'august 2015_4781463(2)',
 'august 2015_4781591(2)',
 'august 2015_4781734(2)',
 'august 2015_4781737(2)',
 'august 2015_4781747(2)',
 'august 2015_4781800(2)',
 'december 2015_4781471(2)',
 'december 2015_4781525(2)',
 'december 2015_4781545(2)',
 'december 2015_4781631(2)',
 'december 2015_4781759(2)',
 'december 2015_4781798(2)',
 'february 2015_4781400(2)',
 'february 2015_4781409(2)',
 'february 2015_4781426(2)',
 'february 2015_4781469(2)',
 'february 2015_4781473(2)',
 'february 2015_4781520(2)',
 'february 2015_4781525(2)',
 'february 2015_4781551(2)',
 'february 2015_4781602(2)',
 'february 2015_4781654(2)',
 'february 2015_4781710(2)',
 'february 2015_4781723(2)',
 'february 2015_4781848(2)',
 'january 2015_4781374(2)',
 'january 2015_4781477(2)',
 'january 2015_4781505(2)',
 'january 2015_4781669(2)',
 'january 2015_4781684(2)',
 'january 2015_4781707(2)',
 'january 2015_4781714(2)',
 'january 2015_4781753(2)',
 'january 2015_4781830(2)',
 'january 2015_4781850(2)',
 'july 2015_4781505(2)',
 'july 2015_4781526(2)',
 'july 2015_4781547(2)',
 'july 2015_4781581(2)',
 'july 2015_4781592(2)',
 'july 2015_4781603(2)',
 'july 2015_4781671(2)',
 'july 2015_4781672(2)',
 'july 2015_4781707(2)',
 'july 2015_4781755(2)',
 'june 2015_4781444(2)',
 'june 2015_4781471(2)',
 'june 2015_4781550(2)',
 'june 2015_4781658(2)',
 'june 2015_4781783(2)',
 'march 2015_4781393(2)',
 'march 2015_4781418(2)',
 'march 2015_4781431(2)',
 'march 2015_4781508(2)',
 'march 2015_4781515(2)',
 'march 2015_4781535(2)',
 'march 2015_4781574(2)',
 'march 2015_4781626(2)',
 'march 2015_4781640(2)',
 'march 2015_4781683(2)',
 'march 2015_4781738(2)',
 'march 2015_4781750(2)',
 'may 2015_4781461(2)',
 'may 2015_4781489(2)',
 'may 2015_4781523(2)',
 'may 2015_4781620(2)',
 'may 2015_4781628(2)',
 'may 2015_4781748(2)',
 'may 2015_4781769(2)',
 'november 2015_4781387(2)',
 'november 2015_4781391(2)',
 'november 2015_4781403(2)',
 'november 2015_4781430(2)',
 'november 2015_4781438(2)',
 'november 2015_4781473(2)',
 'november 2015_4781483(2)',
 'november 2015_4781492(2)',
 'november 2015_4781567(2)',
 'november 2015_4781574(2)',
 'november 2015_4781633(2)',
 'november 2015_4781684(2)',
 'november 2015_4781685(2)',
 'november 2015_4781714(2)',
 'november 2015_4781804(2)',
 'october 2015_4781373(2)',
 'october 2015_4781377(2)',
 'october 2015_4781407(2)',
 'october 2015_4781435(2)',
 'october 2015_4781477(2)',
 'october 2015_4781565(2)',
 'october 2015_4781615(2)',
 'october 2015_4781720(2)',
 'september 2015_4781421(2)',
 'september 2015_4781473(2)',
 'september 2015_4781487(2)',
 'september 2015_4781541(2)',
 'september 2015_4781546(2)',
 'september 2015_4781582(2)',
 'september 2015_4781595(2)',
 'september 2015_4781601(2)',
 'september 2015_4781686(2)',
 'september 2015_4781755(2)',
 'september 2015_4781771(2)']

In [20]:
round(len(trips_data_duplicates_list) / len(trips_data_list), 2)

0.02

2 percent of the files are duplicates, can't ignore that. Let's see what is inside the parentheses, i.e. if the duplicate denoter is always '(2)'.

In [8]:
whats_inside_parentheses

array(['2'], dtype='<U1')

Thus duplicates are always denoted with a postfix of (2). Let see if there is a pattern to the duplicates, compared to the original files.

In [10]:
original_duplicate_tuples = [(x.split('(')[0] + '.csv', x + '.csv') for x in trips_data_duplicates_list]
# convert each path to dataframe and check if they are the same in each tuple
tuple_df = []
equal_array = []
for original, duplicate in original_duplicate_tuples:
    original_df = pd.read_csv(os.path.join(data_path, 'trips_data', original))
    duplicate_df = pd.read_csv(os.path.join(data_path, 'trips_data', duplicate))
    tuple_df.append((original_df, duplicate_df))
    # check if the dataframes are the same
    equal_array.append(original_df.equals(duplicate_df))

In [13]:
sum(equal_array)

111

In [15]:
sum(equal_array) / len(equal_array)

1.0

Thus the duplicates are entirely redundant, and we can remove them.

Let's inspect some individual files to look for more problems.

In [61]:
random_idx = np.random.randint(0, len(trips_data_list))
print(random_idx)

703

In [62]:
shift = 0
random_trip_data_df = pd.read_csv(os.path.join(data_path, 'trips_data', trips_data_list[random_idx+shift]))
print(trips_data_list[random_idx+shift])
random_trip_data_df.sort_values('km', ascending=False).head(10)

august 2015_4781547.csv

,Unnamed: 0,customer,driver_id,end_time,km,start_time
27,27,angel,528,2015-08-14 21:31:00,1591.522299,2015-08-14 14:34:00
21,21,osem,918,2015-08-11 18:53:00,582.585147,2015-08-11 12:01:00
38,38,aminach,421,2015-08-20 10:10:00,579.265576,2015-08-20 02:35:00
26,26,bituch_leumi,543,2015-08-14 06:47:00,567.077779,2015-08-14 00:15:00
19,19,yes,453,2015-08-10 22:24:00,553.174397,2015-08-10 15:50:00
34,34,tnuva,546,2015-08-18 08:30:00,538.374942,2015-08-18 01:40:00
31,31,jerusalem_muni,380,2015-08-16 22:49:00,513.905183,2015-08-16 15:19:00
36,36,iaf,367,2015-08-19 09:44:00,511.050188,2015-08-19 03:27:00
14,14,bituch_leumi,357,2015-08-07 09:56:00,510.574531,NaN
4,4,bituch_leumi,411,2015-08-03 08:25:00,485.876975,2015-08-03 02:11:00

Is it (?) suspicious to see drivers drive 3000 km on the same job, during 2 days?

In [74]:
a = pd.unique(random_trip_data_df['customer'])
b = pd.unique(taarif_df['customer'])
print(a)
print(b)

['hot' 'jerusalem_muni' 'tara' 'intel' 'bituch_leumi' 'angel'
 'electricity' 'osem' 'iaf' 'tnuva' 'yes' 'aminach']
[nan 'jerusalem_muni' 'intel' 'mizranei_kfar_saba' 'dbs' 'tnuva' 'angel'
 'telecommunication_ltd' 'osem' 'iaf' 'tara' 'electricity' 'bituch_leumi']

In [75]:
# whats in a but not in b
a[~np.isin(a, b)]

array(['hot', 'yes', 'aminach'], dtype=object)

It seems the salary table doesn't have customers that appear on the trips table, which is a problem. ASK

Let's unify all the trip tables after while disregarding the duplicates.

In [78]:
trips_data_no_dups_list = [trip for trip in trips_data_list if '(2)' not in trip]
trips_dfs = [pd.read_csv(os.path.join(data_path, 'trips_data', trip)) for trip in trips_data_no_dups_list]
trips_df = pd.concat(trips_dfs, ignore_index=True)
trips_df.head()

,Unnamed: 0,customer,driver_id,end_time,km,start_time
0,0,iaf,570,2015-04-01 09:36:00,672.312716,2015-04-01 01:55:00
1,1,yes,822,2015-04-01 16:17:00,96.048221,2015-04-01 15:12:00
2,2,intel,437,2015-04-02 04:15:00,90.727997,2015-04-02 02:49:00
3,3,yes,70,2015-04-02 15:41:00,216.595350,2015-04-02 12:41:00
4,4,jerusalem_muni,446,NaN,96.437630,2015-04-03 00:15:00

In [80]:
trips_df

,Unnamed: 0,customer,driver_id,end_time,km,start_time
0,0,iaf,570,2015-04-01 09:36:00,672.312716,2015-04-01 01:55:00
1,1,yes,822,2015-04-01 16:17:00,96.048221,2015-04-01 15:12:00
2,2,intel,437,2015-04-02 04:15:00,90.727997,2015-04-02 02:49:00
3,3,yes,70,2015-04-02 15:41:00,216.595350,2015-04-02 12:41:00
4,4,jerusalem_muni,446,NaN,96.437630,2015-04-03 00:15:00
...,...,...,...,...,...,...
318176,49,iaf,549,2015-09-25 18:41:00,338.646624,2015-09-25 14:02:00
318177,50,yes,398,2015-09-26 08:07:00,690.632760,2015-09-26 00:11:00
318178,51,tnuva,924,2015-09-26 16:13:00,74.532361,2015-09-26 15:12:00
318179,52,tara,884,2015-09-27 06:21:00,534.599297,2015-09-27 00:05:00
318180,53,yes,901,2015-09-29 04:01:00,3129.821745,2015-09-27 13:57:00

In [86]:
a = pd.unique(trips_df['customer'])
b = pd.unique(taarif_df['customer'])
a[~np.isin(a, b)]

array(['yes', 'aminach', 'hot'], dtype=object)

In [89]:
b[~np.isin(b, a)]

array([nan, 'mizranei_kfar_saba', 'dbs', 'telecommunication_ltd'],
      dtype=object)

Interesting, common sense can match those (see summary document).

## Trying to assemble the summary table

In [90]:
print(new_drivers_df.columns)
print(old_drivers_df.columns)
print(taarif_df.columns)
print(trips_df.columns)

Index(['Unnamed: 0', 'birthdate', 'gender', 'id', 'vetek'], dtype='object')
Index(['Unnamed: 0', 'birthdate', 'gender', 'id', 'vetek'], dtype='object')
Index(['customer', 'basic_taarif', 'extra_milage', 'night_bonus',
       'weekend_bonus'],
      dtype='object')
Index(['Unnamed: 0', 'customer', 'driver_id', 'end_time', 'km', 'start_time'], dtype='object')

In [ ]:
new_drivers_df['vetek'] = new_drivers_df['vetek'].apply(lambda x: x / 365)
new_drivers_df.drop('Unnamed: 0', axis=1, inplace=True)
old_drivers_df.drop('Unnamed: 0', axis=1, inplace=True)
trips_df.drop('Unnamed: 0', axis=1, inplace=True)

In [91]:
taarif_df['customer']

0                       NaN
1            jerusalem_muni
2                     intel
3        mizranei_kfar_saba
4                       dbs
5                     tnuva
6                     angel
7     telecommunication_ltd
8                      osem
9                       iaf
10                     tara
11              electricity
12             bituch_leumi
Name: customer, dtype: object

In [93]:
taarif_df.replace({
    'telecommunication_ltd': 'hot',
    'dbs': 'yes',
    'mizranei_kfar_saba': 'aminach'
}, inplace=True)
taarif_df.drop(axis=0, index=0, inplace=True)

In [96]:
taarif_df

          customer  basic_taarif  extra_milage  night_bonus  weekend_bonus
1   jerusalem_muni           8.0          40.0         50.0           30.0
2            intel           8.0           6.0         20.0            0.0
3          aminach          15.0           4.0          0.0           25.0
4              yes          10.0           8.0          0.0           25.0
5            tnuva           6.0           3.0         80.0            0.0
6            angel           1.0           5.0        100.0            0.0
7              hot           7.0           7.0         10.0           40.0
8             osem          12.0           4.0         20.0            0.0
9              iaf          20.0          10.0        200.0          500.0
10            tara           6.0           6.0         50.0           30.0
11     electricity          10.0           NaN         40.0        70000.0
12    bituch_leumi           NaN           NaN          NaN            NaN

In [94]:
trips_df.head()

,Unnamed: 0,customer,driver_id,end_time,km,start_time
0,0,iaf,570,2015-04-01 09:36:00,672.312716,2015-04-01 01:55:00
1,1,yes,822,2015-04-01 16:17:00,96.048221,2015-04-01 15:12:00
2,2,intel,437,2015-04-02 04:15:00,90.727997,2015-04-02 02:49:00
3,3,yes,70,2015-04-02 15:41:00,216.595350,2015-04-02 12:41:00
4,4,jerusalem_muni,446,NaN,96.437630,2015-04-03 00:15:00